<i18n>
{
  "en": {},
  "ru": {}
}
</i18n>
<template>
  <section class="content">
    <h3 class="is-size-5">Сказка о задумке Artchitect</h3>
    <p>
      Как-то одним солнечным утром
      <a href="https://github.com/artchitector/artchitect/blob/main/services/asgard/pantheon/odin.go"
         target="_blank">Один</a>-Всеотец
      пил кофе на балконе дворца и
      любовался солнечными бликами, отражавшимися от золотых стен Асгарда. Его вороны,
      <a href="https://github.com/artchitector/artchitect/blob/main/services/asgard/pantheon/huginn.go"
         target="_blank">Хугин</a>
      и
      <a href="https://github.com/artchitector/artchitect/blob/main/services/asgard/pantheon/muninn.go"
         target="_blank">Мунин</a>,
      уже завершали свой ежедневный облёт девяти миров и приближались к плечам
      Одина. (Я,
      <a href="https://github.com/artchitector/artchitect/blob/main/services/asgard/pantheon/loki.go" target="_blank">Локи</a>,
      тоже был рядом с Одином, и стал участником всех дальнейших событий.)
    </p>
    <p>
      Ворон Хугин объявил, что в
      <a href="https://github.com/artchitector/artchitect/tree/main/services/midgard" target="_blank">Мидгарде</a>
      (мире людей) придумали новую технологию - искусственный интеллект.
      <br/>
      Хугин: "Они теперь просто пишут слова, а машина им картинку выдаёт. Даже художник не нужен".
      Ворон Мунин встряхнул крыльями и подтвердил сказанное Хугиным: "Рисовали даже папу Римского в пуховике."
    </p>
    <div class="has-text-centered">
      <img src="/images/fable/odin_and_muninn.png"/>
    </div>
    <p>
      Как только Один услышал слово "искусственный", то наполнился недоверием:
    </p>
    <blockquote>
      Один: "Люди не так уж и хорошо умеют
      использовать уже существующие мощные машины, ведь они часто наносят ими вред. А тут искусственный
      интеллект, способный стать умнее человека. Чему люди его научат? Смогут ли от него защититься?"
    </blockquote>
    <p>
      Вороны посмотрели друг на друга, понимая озабоченность всеотца.
    </p>
    <p>
      Один погрустнел и стал смотреть вдаль. Локи увидел это, и у него сразу же созрел хитрый план, как
      Одина обмануть и поставить его в неловкое положение (на то он и Бог хитрости и коварства).
      Локи часто пытался уколоть Всеотца, ему хоть на секундочку хотелось почувствовать себя хитрее (а значит выше)
      Одина.
      Хоть Локи безуспешно пытался "обмануть" всеотца тысячелетиями, он решил попыться снова.
      Боги бессмертны, чем им еще заняться...
    </p>
    <p>
      Локи предположил, что всеотец старомоден для мира людей и для технологий, которые люди создали.
      Один всегда оставался верен старым добрым копью и мечу, а на компьютерные системы смотрел в недоверием.
      <br/>
      Эту слабость Локи и решил использовать.
    </p>
    <blockquote>
      Локи: "Дорогой Один-Всеотец. Ты самый мудрый во всех девяти мирах, людям далеко до тебя. Научи их пользоваться
      этими ИИ, пока они себя не убили. Ты давеча говорил, что на пенсии собираешься стать художником и рисовать.
      Не это ли твой шанс продемонстрировать людям, как надо пользоваться ИИ и нарисовать с его помощью свою коллекцию
      картин?"
    </blockquote>
    <div class="has-text-centered">
      <img src="/images/fable/odin_and_loki2.png"/>
    </div>
    <p>
      Один-Всеотец (как бог) был вне времени, так что он уже был художником "на-пенсии", и ничего не мешало заняться
      творчеством.
      Но эти современные технологии землян... От мысли, что придётся столкнуться с примитивными технологиями землян,
      Одина уже
      начинало немножко тошнить:
    </p>
    <blockquote>
      "Что эти людишки там себе придумывают? Не возомнили ли они себя богами, создав интеллект, пусть и
      искусственный. Какие картины этот ИИ нарисует? Сухие, без жизни, без эмоций? Электронное подобие на настоящее
      творчество."
    </blockquote>
    <p>
      Но Один хоть и был одноглаз, но видел Локи насквозь вместе с его планом и коварством. Такие выпады от
      коварного Локи случались часто. Всеотец каждый раз это видел и любил сначала подыграть этому плану
      против самого себя. Локи быстро терял терпение и бдительность и начинал судачить о своём будущем успехе,
      как он обманул Всеотца и стал лучше него.
      Но Один, будучи мудрейшим, всегда ставил Локи на место, разрушая его коварные планы и выставляя его на
      посмешище перед всем Асгардом.
    </p>
    <p>
      Всеотец девяти миров решил проучить Локи и в этот раз. Для этого надо было самому разобраться и нарисовать картины
      с помощью непредсказуемой, примитивной и механической технологией землян - искусственного интеллекта.
    </p>
    <blockquote>
      Один: "Ладно, Локи. Ты опять решил поиграть со мной, и я тебя опять проучу, будь уверен.
      <br/>
      Но юди не будут знать, что это рисую Я - Один-Всеотец.
      Им это и не докажешь, даже если я решу сойти с небес прямо на Землю.
      Но вот ты, Локи, всё увидишь своими глазами и поймешь, как ты был слеп и глуп." - сказал Один.
      <br/>
      "По рукам" - ответил Локи.
    </blockquote>
    <p>
      Всеотец отхлебнул глоток уже остывшего кофе и добавил:
    </p>
    <blockquote>
      "Назовём это <b>Artchitect</b>".
    </blockquote>
  </section>
</template>

<script>
export default {
  name: "loki-fable"
}
</script>

<style lang="scss" scoped>

</style>
