<i18n>
{
  "en": {},
  "ru": {}
}
</i18n>
<template>
  <section class="content">
    <h3 class="is-size-5">Сказ о том, как Один и Локи придумали artchitect</h3>
    <p>
      Привет, посетители храма ИИ-искусств artchitect! Я - Локи,
      бог коварства и хитрости из скандинавской мифологии, и я буду вести этот рассказ о проекте
      <a href="https://artchitect.space">artchitect</a>.
    </p>
    <p>
      Мы с Одином-Всеотцом любим иногда сидеть за утренним кофе и обсуждать новости в девяти
      мирах. Так и сегодня, мы сидели вдвоём. Один любовался сверкающими бликами солнца, отражающимися от золотых стен
      дворцов и мостов
      <a href="https://github.com/artchitector/artchitect/tree/main/services/asgard" target="_blank">Асгарда</a>.
      К нам стали приближаться вороны
      <a href="https://github.com/artchitector/artchitect/blob/main/services/asgard/pantheon/huginn.go"
         target="_blank">Хугин</a> и <a
      href="https://github.com/artchitector/artchitect/blob/main/services/asgard/pantheon/muninn.go"
      target="_blank">Мунин</a>. Они как раз завершили
      свой ежедневный облет девяти миров и направились к Одину с докладом о произошедших событиях.
    </p>
    <p>
      Ворон Хугин доложил, что в <a href="https://github.com/artchitector/artchitect/tree/main/services/midgard"
                                    target="_blank">Мидгарде</a> (мире людей) появилась новая технология - искусственный
      интеллект.
      </p>
    <blockquote>
      Хугин: "Теперь они просто пишут слова, а машина создает изображение. Даже живой художник не требуется."<br/>
      Ворон Мунин кивнул согласием: "Даже папу Римского нарисовали в забавном пуховике, за несколько секунд."
    </blockquote>
    <div class="has-text-centered">
      <img src="/images/fable/odin_and_muninn.png"/>
    </div>
    <p>
      Однако, когда Один услышал слова "искусственный интеллект", его лицо нахмурилось:
    </p>
    <blockquote>
      Один: "Люди не всегда справляются с мощными машинами, их неосторожное использование может нанести вред. А здесь
      искусственный интеллект, который может превзойти человека. Чему же люди научат этот интеллект? Смогут ли они его
      контролировать?"
    </blockquote>
    <p>
      Вороны обменялись взглядами, понимая беспокойство Всеотца.
    </p>
    <p>
      Я в это время лишь слушал их диалог - Одина с его воронами. Один опустил голову, и я заметил его уныние.
      Я же унынию не поддался! Теперь у меня появилась хитрая идея, как обмануть Одина и
      поставить его в неловкое положение (ведь я, Локи, известен своей хитростью и коварством).
      Я часто пытался выиграть у Всеотца, стремясь доказать свою превосходство. Хотя мои предыдущие попытки обмануть
      Всеотца были тщетными, но я всё же решил попытаться в очередной раз.
      <br/>
      Боги вечны, и у нас всегда найдется время на игры...
    </p>
    <p>
      Мне пришла в голову мысль, что Один слишком консервативен для современного мира и новых технологий, созданных
      людьми. Всеотец всегда предпочитал инженерным системам старый добрый меч, магию и древние артефакты.
      Именно эту его слабость я и решил использовать.
    </p>
    <blockquote>
      Локи: "Дорогой Один-Всеотец, ты мудрейший среди всех девяти миров, и люди далеко отстают от тебя. Помоги им
      освоить искусственный интеллект, пока они не причинили себе вреда. Ты говорил, что хочешь
      написать пару картин, заняться творчеством. Не представляет ли это для тебя возможность продемонстрировать людям,
      как использовать искусственный интеллект и создать с его помощью свою коллекцию картин?"
    </blockquote>
    <div class="has-text-centered">
      <img src="/images/fable/odin_and_loki2.png"/>
    </div>
    <p>
      Один улыбнулся. Я уже понял, что он узрел мою идею и коварство, как впрочем и всегда. Но еще он и задумался.
      Один - творец, и творчество его основа. Но эти современные технологии землян... Мысль о том, что придется иметь
      дело с примитивными земными технологиями, явно вызывала у Одина недоумение:
    </p>
    <blockquote>
      "Что за чудеса творят эти жители Мидгарда? Неужели они решили, что они боги, создавая искусственный интеллект? И
      какие картины сможет нарисовать этот искусственный интеллект? Бездушные и лишенные эмоций? Электронные подобия
      настоящего искусства."
    </blockquote>
    <p>
      Но Один, несмотря на отсутствие одного глаза, видел сквозь меня и мой хитрый план.
      Мои коварные козни были для него далеко не новостью, а скорее обычным делом. Он любил играть в эту игру,
      поддакивая моим идеям, чтобы затем разрушить мои планы и сделать меня посмешищем перед всем Асгардом.
      <br/>
      В эту игру мы играем тысячи лет.
    </p>
    <p>
      Всеотец девяти миров решил научить меня уроку и в этот раз. Но для этого ему придётся самому разобраться и создать
      картины с использованием непредсказуемой, примитивной и механической земной технологии - искусственного
      интеллекта.
    </p>
    <blockquote>
      Один: "Хорошо, Локи. Ты снова решил поиграть со мной, и я снова научу тебя уроку, несомненно. Но люди не узнают,
      что это мои руки создали. Им этого и не доказать, даже если я бы решил спустить эти картины с небес на землю
      на виду у всего человечества.
      <br/>
      Но ты, Локи, увидишь это своими глазами и поймешь, какой ошибкой было считать себя умнее меня." - сказал Один.
      <br/>
      "По рукам!" - ответил я.
    </blockquote>
    <p>
      Всеотец пригубил последний глоток остывшего кофе и добавил:
    </p>
    <blockquote>
      Один: Назовём это "artchitect".
    </blockquote>
  </section>
</template>

<script>
export default {
  name: "loki-fable"
}
</script>

<style lang="scss" scoped>

</style>
