<i18n>
{
  "en": {
    "title": "Fable of Artchitect"
  },
  "ru": {
    "title": "Миф об Artchitect"
  }
}
</i18n>
<template>
  <section class="content">
    <h1 class="is-size-4">{{ $t('title') }}</h1>
    <div class="notification">
      Код Artchitect архитектурно и идеологически основан на сказочном рассказе по мотивам скандинавской мифологии.
      Все действующие лица существуют в программном коде Artchitect, пишут там свои комментарии
      и участвуют в творческом процессе. Это подкреплено ссылками на исходный код.
    </div>
    <hr />
    <p>
      Привет, посетители храма ИИ-искусств Artchitect. Я - Локи, скандинавский бог
      коварства и хитрости, и я рассказу вам миф, откуда вообще взялся этот проект.
      Мы как-то с Одином придумали рисовать для людей картины, и теперь вы можете их
      увидеть на этом сайте.
    </p>
  </section>
</template>

<script>
export default {
  name: "loki-heading"
}
</script>

<style lang="scss" scoped>

</style>
