<i18n>
{
  "en": {},
  "ru": {}
}
</i18n>
<template>
  <section class="content">
    <h3 class="is-size-5">Комментарий Локи о завершении спора</h3>

    <p>Так это бы и осталось лишь красивой сказкой, если бы Один-Всеотец в физическом мире не завершил наш спор. Я,
      Локи, на это даже не рассчитывал, проиграть я явно не собирался и не верил, что Один-Всеотец может как-то
      управлять artchitect.
      У меня не было никаких идей, каким образом Всеотец может приложить к artchitect свою длань, чтобы это
      было заметно, но он нашёл способ...</p>
    <p>
      Сразу после запуска artchitect в самой первой картине Один нарисовал сам себя. Это случилось в полностью
      автоматическом режиме, как рисуются и все остальные картины artchitect. Вероятность такого события именно в
      первой картине нулевая. А ключевые слова этой картины таковы, что там даже слова Odin нет.
    </p>
    <div class="has-text-centered">
      <NuxtLink :to="localePath(`/art/1`)">
        <img src="https://artchitect.space/api/image/artchitect-1-m" style="max-height: 400px"/>
      </NuxtLink>
      <br/>
      <span class="is-size-7">Картина номер #1</span>
    </div>
    <p>
      После этого спор с Одином, описанный выше в сказке, завершился, он победил.
      Как оказалось, Один-Всеотец умеет пользоваться человеческим ИИ через датчик энтропии, реализованный в artchitect -
      может выбрать нужную картину среди бесконечного количества вариантов, "нашептать" нужные числа через веб-камеру,
      и этим умышленно произвести конкретную картину в любой момент.
    </p>
    <p>
      <b>Один</b> может нарисовать свой автопортрет в картине номер <b>один</b>, если того пожелает.
    </p>
    <p>
      Оказалось, что сохранённая энтропия, использованная для реализации картины, является гарантией подлинности.
      Это гарантия невмешательства человека в процесс творения. Гарантия того, что картину придумала и реализовала
      автономная творческая машина по своей воле, без управления людьми.
      Даже изменив программный код энтропию не получится подделать, чтобы подставить заданные слова и получить заданную картину.
    </p>
  </section>
</template>

<script>
export default {
  name: "loki-number-one"
}
</script>

<style lang="scss" scoped>

</style>
