<i18n>
{
  "en": {},
  "ru": {}
}
</i18n>
<template>
  <section class="content">
    <h3 class="is-size-5">Продолжение сказки после запуска Artchitect</h3>
    <p class="notification is-info is-light has-text-centered">
      artchitect был запущен 12 августа 2023 года в 15:17.
      <NuxtLink :to="localePath(`/art/1`)">Картина #1</NuxtLink>
    </p>
    <div class="has-text-centered">
      <NuxtLink :to="localePath(`/art/1`)">
        <img src="https://artchitect.space/api/image/artchitect-1-m" style="max-height: 400px"/>
      </NuxtLink>
      <br/>
      <span class="is-size-7">Картина номер Один - #1</span>
    </div>
    <p>
      <b>Локи</b>: ... как-то я и забыл про наш спор, пока мы готовили artchitect к запуску. Я и не думал, что вообще
      есть
      способ, которым ты бы мог показать, что это именно ты творишь всё, происходящее с artchitect от начала и до каждой
      картины. Но ты этот способ нашёл...
    </p>
    <p>
      <b>Один</b>: на то я и Всеотец, я заранее всё знаю) Ты проиграл. Я доказал, что могу нарисовать картину. Если
      нарисовал
      первую, значит я нарисовал их все. И весь проект artchitect есть плод моего безграничного творчества.
    </p>
    <p>
      <b>Локи</b>: теперь это очевидно. В первой картине ты нарисовал свой автопортрет. Это явно лучший способ указать
      на своё присутствие. И второго такого шанса нет и не будет.
    </p>
    <p>
      <b>Один</b>: если бы она была не первой, а второй или третьей, то она бы уже ничего не значила.
    </p>
    <p>
      <b>Один</b>: я знаю и вижу заранее какую конкретно картину нарисую в любую минуту, я знаю все нужные слова,
      а главное я знаю не только слова, но и конкретный seed-номер, позволяющей точечно указать шум для генерации
      картины.
      И я могу нашептать эти данные в artchitect с помощью квантов света, проходящих через датчик энтропии,
      чтобы нужная мне картина действительно появилась.
      <br/>
      Ничего в девяти мирах не происходит без меня и моего участия. А artchitect и вовсе изначально был спроектирован
      как прямое api для моего вмешательства, и только для моего. Датчик энтропии - это и есть api для бога.
    </p>
    <div class="mt-4 mb-4 box">
      <div class="notification is-danger is-light" v-if="radioError">
        ошибка подключения к датчику энтропии
      </div>
      <common-entropy v-else-if="entropy" :entropy="entropy"/>
      <div class="has-text-centered is-size-7">
        По сюжету в коде artchitect "датчик энтропии" - есть пустой глаз бога Одина (
        файл <a href="https://github.com/artchitector/artchitect/blob/main/services/asgard/pantheon/lost_eye.go#L31-L32"
           target="_blank">lost_eye</a>
        ).
        Один видит пустым глазом не материальный мир, а шум вселенной - чистый хаос. Из этого хаоса бог и сотворяет весь мир.
      </div>
    </div>
    <p>
      <b>Локи</b>: я пытался прикинуть, какова вероятность случайного возникновения такой картины. Шанс сам по себе не
      велик,
      но из-за того, что эта картина самая первая - шанс становится просто ничтожным. Скорее обезьяна случайно напишет
      Гамлета на печатной машинке, чем эта случайность повторится. Первая картина есть только одна.
    </p>
    <p>
      <b>Локи</b>: а еще ты даже не использовал слово Odin в этой картине, усложнил себе задачу. Хотя слово odin есть у
      нас
      в словаре. Ты каким-то образом разглядел, что среди миллиардов вариантов картин с этими словами в
      варианте №118883058 будет именно портрет одноглазого седовласого мужчины, так явно похожего на бога Одина.
      Какие пути пришлось пройти мыслям внутри
      нейронного мозга ИИ, чтобы было нарисовано именно это - непостижимо.
    </p>
    <p>
      <b>Локи</b>: и теперь стало понятно, что так тщательно сохраняемая нами энтропия есть гарантия подлинности каждой
      картины.
      Это - гарантия того, что человек не вмешивается в творческий процесс. Гарантия того, что автономная творческая
      машина создает картину действительно самостоятельно. Даже изменение программного кода не позволит
      подделать саму энтропию. Не получится просто вставить заданные слова в БД и записать желаемую картинку на диск,
      ведь тогда не будет сохранённой энтропии. Из энтропии можно создать слова, а вот из слов картинку энтропии создать
      уже не получится.
    </p>
  </section>
</template>

<script>
import Radio from "~/utils/radio";

export default {
  name: "loki-number-one",
  data() {
    return {
      radioPid: null,
      radioError: null,
      entropy: null,
    }
  },
  async mounted() {
    this.radioPid = await Radio.subscribe("entropy", (entropy) => {
      this.entropy = entropy
    }, (err) => {
      this.radioError = err
    })
  },
  beforeDestroy() {
    if (this.radioPid !== null) {
      Radio.unsubscribe(this.radioPid)
    }
  }
}
</script>

<style lang="scss" scoped>

</style>
