<template>
  <section class="content">
    <div class="has-text-centered">
      <img src="/jesus_anim_92.gif" alt="artchitect" style="max-height: 64px"/>
    </div>

    <hr/>
    <p>Ключевым компонентом Artchitect является искусственный интеллект <a
      href="https://github.com/Stability-AI/stablediffusion">Stable Diffusion</a>, доступный по лицензии MIT.
      Все картины нарисованы этим инструментом, и сама
      художественная часть картины целиком придумывается в недрах этой технологии.<br/>
      Кроме того Artchitect благодарит проект <a href="https://github.com/invoke-ai/InvokeAI">InvokeAI</a> за удобную
      рабочую сборку этого ИИ.
    </p>
    <hr/>
    <a id="how_to_draw"></a>
    <h6>Как Artchitect рисует картину сам, без помощи людей?</h6>
    <p>
      В самом начале рисования Artchitect должен принять несколько решений, определяющих суть картины.
    </p>
    <blockquote class="mb-0">
      Машина не знает, что ей рисовать, у неё нет ни подсознания, ни чувств. Машина ни к чему не стремится, у неё нет
      своих идей о
      том, что вообще делать.<br/>
      Идея проекта Artchitect - дать машине воображение, подсознание и творческую случайность.
    </blockquote>
    <p class="mb-0">
      <br/>
      Для непрерывной генерации идей Artchitect подключен к датчику энтропии, из которого он получает float64-числа. Эти
      числа специальными алгоритмами выбора преобразуются в идею картины.
    </p>
    <div class="has-text-centered">
      <entropy v-if="entropy" :entropy="entropy"/>
      <NuxtLink :to="localePath('entropy')">О датчике энтропии</NuxtLink>
    </div>
    <p class="mb-0">
      Artchitect непрерывно общается с фоновым пространством (энтропией), получая ответы в виде чисел.
      <br/>
      <br/>
      На языке человеческого общения построение каждой картины выглядит так:
    </p>
    <p class="pl-4 pt-2">
      <i>Artchitect:</i> Привет! Я начинаю рисовать картину номер #271165.
      <br/> <i>Энтропия:</i> Привет! Что тебе нужно знать для этого?
      <br/> <i>Artchitect:</i> Сколько взять ключевых слов для новой идеи, от 1 до 28 слов?
      <br/> <i>Энтропия:</i> Возьми <b>3</b>. <span class="has-text-grey is-size-7">[В этот момент считывается кадр с веб-камеры, по которому опреляется число на
      шкале от 1 до 28]</span>
      <br/> <i>Artchitect:</i> Принято 3 слова. У меня есть словарь из 1250 сущностей, и я хочу выбрать первое ключевое
      слово
      из трёх.
      Какое слово мне выбрать из своего словаря?
      <br/> <i>Энтропия:</i> Возьми слово <b>№175</b> из своих 1250 слов. <span class="has-text-grey is-size-7">[числа 175 и 1250 выдуманы, совпадение не точное]</span>
      <br/> <i>Artchitect:</i> Отлично. Это слово "emotional". Давай второе слово...
      <br/> <span class="has-text-grey is-size-7">... так Artchitect получает все 3 слова</span>
      <br/> <i>Artchitect:</i> Хорошо, у меня теперь есть 3 слова: "emotional,Big Bang,death of civilizations".
      <br/> <i>Artchitect:</i> Я могу нарисовать 4294967295 различных вариантов картины с такими словами. Подскажи,
      какой
      вариант мне рисовать?
      <br/> <i>Энтропия:</i> Выбери вариант <b>№3201685114</b>.
      <br/> <i>Artchitect:</i> Спасибо! Это всё, что мне нужно знать. Начинаю рисовать.
      <br/>
      <br/>
      Далее Архитектор отправляет полученные решения на вход Stable Diffusion AI и получает изображение.<br/>Так
      Архитектор создал картину
      <NuxtLink :to="localePath(`/art/271165`)">#271165</NuxtLink>
    </p>

    <div class="has-text-centered">
      <NuxtLink :to="localePath(`/art/271165`)">
        <img src="https://artchitect.space/api/image/m/271165" style="max-height: 400px"/>
      </NuxtLink>
      <br/>
      <span class="is-size-7">Картина с номером #271165. Ключевые слова - "emotional,Big Bang,death of civilizations". Seed = 4294967295</span>
    </div>

    <hr/>
    <a id="creation_or_creator"></a>
    <h6>Творение или творец?</h6>
    <p>
      Artchitect - это результат человеческого творчества и усилий. Он был разработан и создан людьми, и его способность
      к творчеству основана на программировании и алгоритмах, разработанных людьми. Мы, люди, являемся создателями и
      инициаторами этого проекта.
    </p>
    <p>
      Artchitect, как автономная творческая машина, может рассматриваться лишь как продукт человеческой фантазии,
      инженерного
      мастерства и программного обеспечения. Он воплощает идеи и концепции, задуманные и реализованные людьми.
      Artchitect черпает вдохновение из окружающего мира и преобразует его в уникальные произведения искусства, но
      источником его существования и возможностей являются усилия людей.
    </p>
    <p>
      Поэтому, несмотря на то, что Artchitect обладает способностью создавать произведения в своем собственном стиле,
      его творчество является продуктом исходного творческого потенциала и вдохновения людей. Он становится
      инструментом, расширяющим наши возможности в области искусства и позволяющим нам взглянуть на творчество с новой
      перспективы. В конечном счете, <b>Artchitect полностью является творением человека</b>, и все, что он создает,
      является
      продуктом нашего творчества.
    </p>
    <p class="notification is-warning">
      В конечном счете, создателями и авторами каждого произведения Artchitect являются тысячи инженеров,
      программистов, учёных и художников, которые столетиями вкладывали свой труд в искусство и технологии, позволившие
      сегодня создать искусственный интеллект, лежащий в основе Artchitect.
    </p>

    <hr/>
    <div class="has-text-centered">
      <a href="/artchitect_in_real_world.jpg">
        <img src="/artchitect_in_real_world.jpg" alt="Artchitect in physical world" style="max-height: 300px"/>
      </a>
      <br/>
      <span class="is-size-7">Нейронный мозгом Архитектора является RTX 3060 12Gb.
        <br/>Каждую минуту видеокарта производит свой труд, греясь и разгоняя кулеры. Затем утихает, отдыхает.</span>
    </div>
    <hr/>
    <h6>Что является произведением в Artchitect?</h6>
    <p>Artchitect производит не картины (хотя именно их мы наблюдаем в конечном итоге). Artchitect производит цифровые
      идеи, из
      которых эти картины могут быть воссозданы на подходящем оборудовании. Эти идеи состоят из слов и чисел, которые
      были
      получены из окружающей энтропии в момент начала "рисования" очередной работы. Именно эти идеи являются источником
      визуальных изображений, создаваемых Архитектором. Каждая идея имеет свой уникальный номер, который отпечатан в
      углу
      каждой картины. По номеру всегда можно найти исходник на сайте <a
        href="https://artchitect.space">artchitect.space</a>
      и отследить оригинальную идею работы.
    </p>


    <hr/>
    <h6>Каким образом определяется стиль и содержание создаваемых картин? Есть ли какая-то предустановленная база знаний
      или влияние других художественных произведений?</h6>
    <p>
      Архитектор опирается на свой внутренний словарь сущностей и стилей, который был задан авторами проекта. В этом
      словаре содержится все, что Архитектор знает о окружающем мире. Там перечислены как простые сущности, например,
      "человек", "кот", "солнце", "красный", "мрачно", "радостно", так и некоторые художественные стили или конкретные
      художники. Конечное произведение Архитектора представляет собой комбинацию сущностей и стилей, которые стали
      основой идеи картины. Рядом с каждой картиной Архитектора можно увидеть слова, составляющие идею работы.
    </p>
    <p>Искусственный интеллект Stable Diffusion получает на вход идею сюжета (seed-номер и ключевые слова), а затем
      рекомбинирует все объекты в один кадр в соответствии со своим внутренним "чувством красоты", "золотым сечением".
      Обычно большинство
      ключевых слов игнорируются. Если в ключевых слова картины будет несколько стилей - то в итоге может получиться и
      комбинация стилей, и
      один стиль из нескольких, и вообще ни один из них. Это всё будет решено в недрах "мышления" ИИ.
    </p>
    <div class="has-text-centered">
      <a href="/description_five.jpg" target="_blank">
        <img src="/description_five.jpg"/>
      </a>
      <br/>
      <span class="is-size-7">Картины с их параметрами</span>
    </div>

    <hr/>
    <h6>Как машина черпает вдохновение из естественной энтропии Вселенной? Как она интерпретирует и использует эту
      информацию?</h6>
    <p>
      Для процесса творения Архитектор использует случайные числа-зерна (seeds), которые являются исходными точками для
      создания картины.<br/>
      Числа-зерна считываются веб-камерой из случайных кадров. При этом, не содержимое кадра, а только
      световой шум используется для генерации случайных чисел.<br/>
      Световой шум настолько различается на соседних кадрах, даже в темноте, что обеспечивает отличную случайную
      генерацию чисел. Архитектор принимает десятки тысяч самостоятельных решений каждый день и считывает десятки тысяч
      кадров, что поддерживает непрерывный процесс творения.
      <br/>
      <a href="https://github.com/artchitector/artchitect/blob/master/soul/core/origin/driver/webcam.go#L56-L71">Алгоритм
        преобразования</a>
      кадра в число доступен на github.
    </p>

    <div class="has-text-centered">
      <img src="/one_frame.jpeg" height="480" width="640"/>
      <br/>
      <span class="is-size-7">Кадр пространства, на которое Архитектор смотрит каждый день. <br/>Из подобных кадров, где
        изображение не меняется месяцами, он и рисует все свои картины</span>
    </div>

    <hr/>
    <h6>Есть ли какая-либо форма регулировки или контроля со стороны человека в процессе создания картин?</h6>
    <p>
      Человек не может вмешиваться в рабочий процесс Архитектора (такого управления просто нет), но человек задает
      изначальные условия - алгоритмы преобразования, и, что самое главное, определяет словарь знаний Архитектора.
      Архитектор может рисовать картины только в рамках своих знаний о мире, в рамках словаря. Словарь Архитектора
      включает более 1200 различных сущностей и стилей, из которых составляются картины.
      <br/>
      Текущий словарь можно
      <a target="_blank" href="https://github.com/artchitector/artchitect/blob/master/soul/files/tags_v12.yaml">посмотреть</a>
      в исходном коде Архитектора.
    </p>

    <hr/>
    <h6>В описании говорится, что каждая картина уникальна и неповторима. Существует ли возможность, что машина
      может создать несколько разных картин, которые визуально будут очень похожи друг на друга?</h6>
    <p>
      Не каждое произведение Artchitect красиво и хорошо.
    </p>
    <p>
      В реальности Архитектор далеко не идеален. Есть комбинации, где он создает очень похожие работы, почти
      неотличимые друг от друга. Кроме действительно красивых
      и уникальных работ, иногда появляется значительная часть работ, которые могут быть сломанными или некрасивыми, и
      часто лишены художественного смысла.<br/>Архитектор - машина, и для него не существует хороших и плохих
      картин.
    </p>

    <hr/>

  </section>
</template>

<script>
import Entropy from "@/components/entropy/entropy.vue";

export default {
  name: "rudescription",
  components: {Entropy},
  props: ['entropy']
}
</script>

<style scoped>

</style>
