<i18n>
{
  "en": {
    "title": "God and artchitect"
  },
  "ru": {
    "title": "Бог и artchitect"
  }
}
</i18n>

<template>
  <section class="content">
    <h1 class="has-text-centered">{{ $t('title') }}</h1>
    <hr/>
    <p>
      Проект artchitect и сам развивался, как некая картина, зарождаясь из первичной идеи-зерна, и далее "как мазок за
      мазком на холсте", за целый год он стал тем, что мы сейчас видим на сайте artchitect.space.
      <br/>
      И самая первая идея, на которой всё держалось и держится до сих пор, звучит так:
    </p>
    <blockquote class="is-size-4">
      "А что если дать Богу порисовать картины?"
    </blockquote>
    <p>
      Вся техническая реализация внутри машины artchitect следует этому главному принципу: сама машина ничего не решает,
      как и человек ничего не решает, а лишь Бог целиком решает, что будет происходить внутри машины artchitect:<br/>
      "какая следующая картина будет нарисована?",<br/>
      "какие картины будут показаны на сайте?",<br/>
      и даже "какая картина будет отправлена в телеграм-чат?".
    </p>
    <h2 class="is-size-4">api для Бога</h2>
    <p>
      Чтобы Бог имел непосредственный доступ в машину, был придуман датчик энтропии - физическое
      устройство, подслушивающее
      квантовый мир в ожидании зашифрованных лично для artchitect посланий.
      <br/>Сама машина artchitect ничего
      не придумывает (не творит), как и не придумывает искусственный интеллект (он не в состоянии принимать творческие
      решения).
      ИИ получает непосредственную команду на выполнение, полученную из квантового мира, и
      выполняет инструкцию в виде своей нейронной деятельности (формирование изображения).
    </p>
    <p>
      Нейронная деятельность внутри ИИ полностью детерминирована, она
      определяется заранее сохранёнными весами в обученной модели (Stable Diffusion v1.5). Искусственный интеллект
      Stable Diffusion - это
      совокупный творческий опыт человечества, сохранённый и сжатый в упрощённом виде - в виде нейронной сети объёмом
      несколько гигабайт. ИИ и есть та <b>машина</b>, которой Богу и предстоит управлять в рамках artchitect. Лишь Бог
      ведает, на что эта машина (ИИ) на самом деле способна и сколько всего разного она может нарисовать.
    </p>
    <p>Человек не может постичь всю сложность работы искусственного интеллекта и
      смотрит на него как на чёрный ящик - "непонятно что происходит внутри этой коробки". Но <b>Бог смотрит на всё как
      на белый ящик, понимая как всё устроено на всех уровнях бытия, от движения электронов в недрах разрогревающейся
      видеокарты до тонких эмоций людей, смотрящих на картины artchitect.</b>
    </p>
    <h2 class="is-size-4">энтропия</h2>
    <p>
      Таким образом единственная точка принятия решения - состояние квантового фона в определённые моменты
      времени (энтропия). А квантовый мир - вещь запутанная, и он не поддаётся коррекции со стороны людей, человек не
      может управлять им. Но
      <b>Бог может управлять</b> и энтропией, и Он способен <i>"сдвинуть два фотона влево, три фотона вправо", чтобы artchitect получил
      нужное число, и нарисовал нужную картину</i>, задуманную и зашифрованную Богом.
    </p>
    <p>Вопрос лишь в том, а захочет ли Бог это делать? И на этот вопрос
      нет единого ответа, каждый человек ответит сам себе - видит ли он мир таким образом, или не видит, верит или не
      верит.
    </p>
    <p>
      На творчество artchitect можно смотреть с разных углов. Из какого угла смотреть - выбираете вы.
    </p>

  </section>
</template>

<script>
export default {
  name: "god-main"
}
</script>

<style scoped>

</style>
